CAL/31.tex
% Created 2017-10-08 dom 12:34
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\setcounter{secnumdepth}{0}
\usepackage{amsthm}
\usepackage{amsmath}
\usepackage{tikz-cd}
\theoremstyle{plain}
\newtheorem{theorem}{Teorema}
\newtheorem{proposition}{Proposición}
\newtheorem{lemma}{Lema}
\newtheorem{corollary}{Corolario}
\theoremstyle{definition}
\newtheorem{definition}{Definición}
\newtheorem{proofs}{Demostración}
\theoremstyle{remark}
\newtheorem*{remark}{Nota}
\renewcommand*{\proofname}{Demostración}
\newenvironment{statement}{\noindent\rule[0.5ex]{\linewidth}{1pt}\begin{em}}{\end{em}\newline\noindent\rule[0.5ex]{\linewidth}{1pt}}
\DeclareMathOperator{\im}{Im}
\DeclareMathOperator{\coker}{Coker}
\DeclareMathOperator{\spec}{Spec}
\setlength{\parindent}{0pt}
\newcommand{\twopartdef}[4]{\left\{\begin{array}{ll} #1 & \mbox{if } #2 \\ #3 & \mbox{if } #4 \end{array} \right.}
\newcommand{\threepartdef}[6]{\left\{\begin{array}{lll} #1 & \mbox{if } #2 \\ #3 & \mbox{if } #4 \\ #5 & \mbox{if } #6 \end{array} \right.}
\author{Ricardo Ruiz}
\date{\today}
\title{Ejercicio 31}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\section{Enunciado}
\label{sec-1}

Sea \(A = \left\{ 1 + \frac{1}{n}: n \in \mathbb{N} \right\}\). 

\section{Prueba que \(\inf A = 1\)}
\label{sec-2}

Por la observación 1.13.2, si $\alpha = inf A = 1$, entonces

\[
\forall \varepsilon > 0 \quad \exists x_\varepsilon \in A: \quad  x_\varepsilon < \alpha + \varepsilon
\]

Por tanto, \(x_\varepsilon < 1 + \varepsilon\), y como
\(x_\varepsilon \in A\) entonces \(x_\varepsilon = 1 + \frac{1}{n_\varepsilon}\)

Así, se tiene que:

\[
1 + \frac{1}{n_\varepsilon} < 1 + \varepsilon; \quad 
\frac{1}{n_\varepsilon} < \varepsilon
\]

Despejando \(n_\varepsilon\):

\[ \frac{1}{\varepsilon} < n_\varepsilon \]

Y esto es cierto \(\forall \varepsilon \in \mathbb{R}_0^+ \quad \forall n_\varepsilon \in \mathbb{N}\) , ya que según la propiedad arquimediana,
dado cualquier número real, se verifica que hay números naturales mayores que él.

\subsection{¿Tiene \(A\) mínimo?}
\label{sec-2-1}

Si \(\inf A \in A \Rightarrow \min A = \inf A\)

Suponiendo que \(\inf A \in A\), se tiene que

\[ 1 + \frac{1}{n_i} = 1\]

Pero entonces, \(\frac{1}{n_i} = 0\) lo cual es absurdo \(\forall n_i \in \mathbb{N}\), y por tanto $A$ no tiene mínimo.

\subsection{¿Y máximo?}
\label{sec-2-2}

Suponiendo que \(k=\max A\), entonces por definición:

\[\exists! k:\quad k \geq a \quad \forall a \in A \quad y \quad k \in A\]

Es decir,

\[ k \geq 1 + \frac{1}{n} \quad \forall n \in \mathbb{N} \]

Y como \(k \in A\), tiene la forma \(1 + \frac{1}{n_k}\),
para un único \(n_k \in \mathbb{N} \).

Entonces, se tiene que

\[ 1 + \frac{1}{n_k} \geq 1 + \frac{1}{n}\], de donde se deduce que \(n_k \leq n \quad \forall n \in \mathbb{N} \)

Como el único número natural menor o igual que todos es el \(1\).

\[n_k = 1 \Rightarrow k = 1 + \frac{1}{1} = 2\]

Por tanto, $A$ tiene máximo que es igual a \(2\).
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}